app/controllers/api/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'new@158ltd.co' LIMIT 1
INSERT INTO `users` (`created_at`, `email`, `first_name`, `last_name`, `password`, `pin`, `updated_at`) VALUES ('2014-08-27 06:52:38', 'new@158ltd.co', 'Dimitar', 'Danailov', 'test', '881222', '2014-08-27 06:52:38')
---
   def register_user

    valid_keys = ["email", "password", "first_name", "last_name", "pin"]
    # Trim user params
    params.trim_params

    unless Request.has_valid_keys?(valid_keys, params)
      json_error = generate_invalid_request_params
      Request.repond_to_with_error(json_error) and return
    end

    if User.find_by(email: params[:email])
      json_error = generate_json_error_object(402, "json_errors.user_exist_into_db")
      Request.repond_to_with_error and return
    end

    # Try to save record into a database
    user = User.new
    valid_keys.each do |key|
      user[key] = params[key]
    end

    if user.valid?
      user.save