app/controllers/api/vehicle_devices_controller.rb

SELECT `vehicle_devices`.* FROM `vehicle_devices` WHERE `vehicle_devices`.`unique_id` = '32' ORDER BY `vehicle_devices`.`id` ASC LIMIT 1
---
  def get_line_name_by_uuid
    param_keys = ["uuid"]
    params_are_valid = params_keys_exist_in_request?(param_keys, params)

    if params_are_valid
      device = VehicleDevice.where(:unique_id => params[:uuid]).first

SELECT `vehicle_devices`.* FROM `vehicle_devices` WHERE `vehicle_devices`.`unique_id` = '11t1' ORDER BY `vehicle_devices`.`id` ASC LIMIT 1
---
  def get_vehicle_users
    param_keys = ["uuid"]
    params_are_valid = params_keys_exist_in_request?(param_keys, params)

    if params_are_valid
      device = VehicleDevice.where(:unique_id => params[:uuid]).first