app/controllers/card_purches_controller.rb

  def index
    @card_purches = CardPurch.all
---
SELECT `card_purches`.* FROM `card_purches`

  def make_card_purches
    # generate_testing_data_create_purchase
    param_keys = ["user_id", "line_name", "card_type"]
    params_are_valid = check_params_keys_exist_into_request(param_keys, params)

    json_error = nil

    if params_are_valid
      begin
       card_purches = CardPurch.new
       card_purches[:user_id] = params[:user_id]
       card_purches[:expire_date] = CardPurch.generate_expire_date

       # Get line info
       line = Line.where("name = ?", params[:line_name]).first
       unless line.blank?
         card_purches[:line_id] = line[:id]
       end

       # Get transport card type
       card_type = TransportCardType.where("name = ?", params[:card_type]).first
       unless card_type.blank?
         card_purches[:transport_card_type_id] = card_type[:id]
       end

       if card_purches.valid?
         card_purches.save
---
SELECT `lines`.* FROM `lines` WHERE (name = 1) ORDER BY `lines`.`id` ASC LIMIT 1
SELECT `lines`.* FROM `lines` ORDER BY `lines`.`id` ASC LIMIT 1
SELECT `transport_card_types`.* FROM `transport_card_types` WHERE (name = 'Test') ORDER BY `transport_card_types`.`id` ASC LIMIT 1
SELECT `transport_card_types`.* FROM `transport_card_types` ORDER BY `transport_card_types`.`id` ASC LIMIT 1
INSERT INTO `card_purches` (`created_at`, `expire_date`, `line_id`, `transport_card_type_id`, `updated_at`, `user_id`) VALUES ('2014-05-10 20:05:15', '2014-05-12 20:05:15', 102, 1, '2014-05-10 20:05:15', 1)

  def get_active_tickets_by_uuid_and_user
    param_keys = ["user_id", "uuid"]
    params_are_valid = check_params_keys_exist_into_request(param_keys, params)

    card_purches = Array.new
    json_error = nil

    if params_are_valid
      user_id = params[:user_id]
      unless User.find_by(id: user_id)
        json_error = generate_json_error_object(403, "json_errors.user_doesnt_exist_into_our_database")
      end

#      current_vehicle_device = VehicleDevice.find_by(unique_id: params[:uuid])
#      unless current_vehicle_device
#        json_error = generate_json_error_object(403, "json_errors.uuid_invalid_database_info")
#      end

      if json_error.blank?
        db_card_purches = CardPurch.get_active_card_purches_by_user_id(user_id)
        db_card_purches.each do |db_card|
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT id, line_id, expire_date FROM `card_purches` WHERE (user_id = '1' AND expire_date >= '2014-05-10 20:49:08') ORDER BY expire_date ASC

    def set_card_purch
      @card_purch = CardPurch.find(params[:id])
---
SELECT `card_purches`.* FROM `card_purches` WHERE `card_purches`.`id` = 0 LIMIT 1