app/controllers/lines_controller.rb

SELECT `lines`.* FROM `lines`
---
  def index
    @lines = Line.all

INSERT INTO `lines` (`created_at`, `name`, `price`, `updated_at`) VALUES ('2014-05-09 20:52:56', '102A', 10.2, '2014-05-09 20:52:56')
---
  def create
    @line = Line.new(line_params)

    respond_to do |format|
      if @line.save

DELETE FROM `lines` WHERE `lines`.`id` = 1
---
  def destroy
    @line.destroy

SELECT `lines`.* FROM `lines` WHERE `lines`.`id` = 1 LIMIT 1
---
    def set_line
      @line = Line.find(params[:id])