app/controllers/line_devices_controller.rb

SELECT `line_devices`.* FROM `line_devices`
---
  def index
    @line_devices = LineDevice.all

INSERT INTO `line_devices` (`created_at`, `line_id`, `updated_at`, `vehicle_device_id`) VALUES ('2014-05-10 06:46:55', 1, '2014-05-10 06:46:55', 1)
---
  def create
    @line_device = LineDevice.new(line_device_params)

    respond_to do |format|
      if @line_device.save

DELETE FROM `line_devices` WHERE `line_devices`.`id` = 2
---
  def destroy
    @line_device.destroy

SELECT `line_devices`.* FROM `line_devices` WHERE `line_devices`.`id` = 2 LIMIT 1
---
    def set_line_device
      @line_device = LineDevice.find(params[:id])