app/controllers/transport_card_types_controller.rb

  def index
    @transport_card_types = TransportCardType.all
---
SELECT `transport_card_types`.* FROM `transport_card_types`

  def create
    @transport_card_type = TransportCardType.new(transport_card_type_params)

    respond_to do |format|
      if @transport_card_type.save
---
INSERT INTO `transport_card_types` (`created_at`, `name`, `updated_at`) VALUES ('2014-05-09 20:48:55', 'Test', '2014-05-09 20:48:55')

    def set_transport_card_type
      @transport_card_type = TransportCardType.find(params[:id])
---
SELECT `transport_card_types`.* FROM `transport_card_types` WHERE `transport_card_types`.`id` = 1 LIMIT 1