app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `first_name`, `last_name`, `password`, `picture`, `pin`, `updated_at`) VALUES ('2014-05-09 20:07:41', '', '', '', '', '', '', '2014-05-09 20:07:41')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

INSERT INTO `users` (`created_at`, `email`, `first_name`, `last_name`, `password`, `pin`, `updated_at`) VALUES ('2014-05-10 18:47:12', 'test@email.com', 'Dimitar', 'Danailov', 'e10adc3949ba59abbe56e057f20f883e', '881222', '2014-05-10 18:47:12')
---
  def register_user
    #load_testing_register_details

    param_keys = ["email", "password", "first_name", "last_name", "pin"]
    params_are_valid = check_params_keys_exist_into_request(param_keys, params)
    user_id = nil

    begin
      if params_are_valid

        user = User.new
        param_keys.each do |key|
          user[key] = params[key]
        end

        if user.valid?
          user.save

SELECT id, first_name, last_name FROM `users` WHERE (email = 'galininsweden@gmail.com' AND password = 'e10adc3949ba59abbe56e057f20f883e') ORDER BY `users`.`id` ASC LIMIT 1
---
    def set_user
      @user = User.where('id = ?', params[:id]).first