app/controllers/vehicle_devices_controller.rb

  def index
    @vehicle_devices = VehicleDevice.all
---
SELECT `vehicle_devices`.* FROM `vehicle_devices`

  def create
    @vehicle_device = VehicleDevice.new(vehicle_device_params)

    respond_to do |format|
      if @vehicle_device.save
---
INSERT INTO `vehicle_devices` (`created_at`, `major`, `minor`, `unique_id`, `updated_at`) VALUES ('2014-08-25 14:12:24', -2, -2, '54635', '2014-08-25 14:12:24')

    def set_vehicle_device
      @vehicle_device = VehicleDevice.find(params[:id])
---
SELECT `line_devices`.* FROM `line_devices` WHERE `line_devices`.`vehicle_device_id` = 2 ORDER BY `line_devices`.`id` ASC LIMIT 1
SELECT `vehicle_devices`.* FROM `vehicle_devices` WHERE `vehicle_devices`.`id` = 1 LIMIT 1